import 'testmodel.dart';

TestModel loadQuestion(int questionIndex) {
  List<TestModel> questionList = [
    TestModel("ماذا تمثل الاشارة؟", "0.png", "رقم الصفر", [
      "حرف السين",
      "رقم التسعة",
    ]),
    TestModel(
        "ماذا تمثل الاشارة", "6.png", "رقم الستة", ["حرف الواو", "رقم الواحد"]),
    TestModel(
        "ماذا تمثل الاشارة؟", "ن.png", "حرف النون", ["حرف الهاء", "حرف الجيم"]),
    TestModel("ماذا تمثل الاشارة؟", "9.png", "رقم التسعة",
        ["حرف الدال", "حرف الباء"]),
    TestModel("ماذا تمثل الاشارة؟", "7.png", "رقم السبعة",
        ["رقم الثمانية", "حرف الطاء"]),
    TestModel(
        "ماذا تمثل الاشارة؟", "م.png", "حرف الميم", ["حرف السين", "حرف الياء"]),
    TestModel("ماذا تمثل الاشارة؟", "ر.png", "حرف الراء", [
      "حرف الباء",
      "رقم الاثنين",
    ]),
    TestModel(
        "ماذا تمثل الاشارة؟", "ا.png", "حرف الألف", ["حرف الثاء", "حرف الياء"]),
    TestModel(
        "ماذا تمثل الاشارة؟", "س.png", "حرف السين", ["حرف الصاد", "حرف الذال"]),
    TestModel("ماذا تمثل الاشارة؟", "ي.png", "حرف الياء",
        ["حرف الهاء", "رقم الاربعة"]),
  ];
  return questionList[questionIndex];
}
